{"pageProps":{"note":{"id":"2d1bqgsxku4o5my9c3t7hvl","title":"Investigation","desc":"Key findings, arrests, and oversight actions following the Wang Fuk Court blaze.","updated":1764806900000,"created":1764709856652,"custom":{},"fname":"hong-kong-fire-2025.investigation","type":"note","vault":{"fsPath":"vault"},"contentHash":"257a6bec398ee9b307f464ed5cf20cf6","links":[{"type":"wiki","from":{"fname":"hong-kong-fire-2025.investigation","id":"2d1bqgsxku4o5my9c3t7hvl","vaultName":"vault"},"value":"hong-kong-fire-2025","alias":"hong-kong-fire-2025","position":{"start":{"line":2,"column":9,"offset":9},"end":{"line":2,"column":32,"offset":32},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"hong-kong-fire-2025"}},{"from":{"fname":"hong-kong-fire-2025","vaultName":"vault"},"type":"backlink","position":{"start":{"line":10,"column":90,"offset":1019},"end":{"line":10,"column":127,"offset":1056},"indent":[]},"value":"hong-kong-fire-2025.investigation","alias":"hong-kong-fire-2025.investigation"},{"from":{"fname":"hong-kong-fire-2025","vaultName":"vault"},"type":"backlink","position":{"start":{"line":23,"column":3,"offset":9524},"end":{"line":23,"column":40,"offset":9561},"indent":[]},"value":"hong-kong-fire-2025.investigation","alias":"hong-kong-fire-2025.investigation"},{"from":{"fname":"hong-kong-fire-2025.people","vaultName":"vault"},"type":"backlink","position":{"start":{"line":67,"column":233,"offset":20904},"end":{"line":67,"column":270,"offset":20941},"indent":[]},"value":"hong-kong-fire-2025.investigation","alias":"hong-kong-fire-2025.investigation"},{"from":{"fname":"hong-kong-fire-2025.timeline","vaultName":"vault"},"type":"backlink","position":{"start":{"line":85,"column":11,"offset":22558},"end":{"line":85,"column":48,"offset":22595},"indent":[]},"value":"hong-kong-fire-2025.investigation","alias":"hong-kong-fire-2025.investigation"},{"from":{"fname":"hong-kong-fire-2025.timeline","vaultName":"vault"},"type":"backlink","position":{"start":{"line":99,"column":11,"offset":24424},"end":{"line":99,"column":48,"offset":24461},"indent":[]},"value":"hong-kong-fire-2025.investigation","alias":"hong-kong-fire-2025.investigation"}],"anchors":{"findings-and-evidence":{"type":"header","text":"Findings and Evidence","value":"findings-and-evidence","line":16,"column":0,"depth":2},"insurance-and-liability":{"type":"header","text":"Insurance and Liability","value":"insurance-and-liability","line":33,"column":0,"depth":2},"tender-irregularities-and-oversight-gaps":{"type":"header","text":"Tender Irregularities and Oversight Gaps","value":"tender-irregularities-and-oversight-gaps","line":37,"column":0,"depth":2},"arrests-and-probes":{"type":"header","text":"Arrests and Probes","value":"arrests-and-probes","line":57,"column":0,"depth":2},"open-questions":{"type":"header","text":"Open Questions","value":"open-questions","line":69,"column":0,"depth":2},"official-statements-and-gaps":{"type":"header","text":"Official Statements and Gaps","value":"official-statements-and-gaps","line":74,"column":0,"depth":2},"prior-warnings":{"type":"header","text":"Prior Warnings","value":"prior-warnings","line":81,"column":0,"depth":2}},"children":[],"parent":"9e5b0uhf2vl7gk4rj1tzp3x","data":{}},"body":"<h1 id=\"investigation\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#investigation\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Investigation</h1>\n<p>Parent: <a href=\"/notes/9e5b0uhf2vl7gk4rj1tzp3x\">🔥 Hong Kong Fire 2025</a></p>\n<p><img src=\"/assets/mesh_and_scaffolding.webp\" alt=\"Melted green mesh on Wang Fuk Court towers; bamboo scaffold remains largely intact.\"></p>\n<p>Photo: Mak Yenting/RFI.</p>\n<h2 id=\"findings-and-evidence\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#findings-and-evidence\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Findings and Evidence</h2>\n<ul>\n<li><strong>Materials evidence</strong>: Police collected 20 netting samples across Wang Tai, Wang Do, Wang Yan, Wang Chi; 7 failed flammability tests, with harder-to-reach samples more likely to fail, raising mixing/switching suspicions (NBC/AP, RTHK). ICAC says contractors bought ~2,300 rolls of non-compliant mesh at HK$54/roll after typhoon damage, then 115 rolls of compliant mesh at HK$100/roll installed at scaffold bases to pass spot checks (news.gov.hk).</li>\n<li><strong>Independent burn tests</strong>: InMedia collected 40 scaffold-net fragments within ~400m of the site (Nov 29–Dec 2); 5 samples ignited instantly and burned upward with falling fire debris (some for up to ~6 minutes), while ~70% would not ignite and 8 shed fire flecks without lighting paper below. Construction union leader Chau Si-kit (周思傑) noted compliant nets can light but should self-extinguish quickly, and standards bar sustained flame/dripping (<a href=\"https://www.inmediahk.net/node/%E6%94%BF%E7%B6%93/%E3%80%90%E5%AE%8F%E7%A6%8F%E8%8B%91%E4%BA%94%E7%B4%9A%E7%81%AB%E3%80%91%E3%80%8A%E7%8D%A8%E5%AA%92%E3%80%8B%E5%AF%A6%E6%B8%AC%E5%AE%8F%E7%A6%8F%E8%8B%91%E6%96%B9%E5%9C%93%E5%8D%8A%E5%85%AC%E9%87%8C40%E6%A3%9A%E7%B6%B2%E7%A2%8E%E5%A1%8A-%E4%BA%94%E6%A8%A3%E6%9C%AC%E7%81%AB%E5%8B%A2%E8%BF%85%E9%80%9F%E8%94%93%E5%BB%B6\">InMediaHK</a>).</li>\n<li><strong>Foam/polystyrene</strong>: Panels sealed windows (incl. elevator lobbies), accelerating spread; melted at >500C and blew out windows (Reuters/CNN).</li>\n<li><strong>Alarms and systems</strong>: Post-fire inspections found alarms non-functional across all eight towers; some residents say alarms switched off during works (CNN/BBC). A Wang Cheong resident’s door-cam footage shows no alarm and smoke engulfing the corridor within 8 minutes (2:52–3:00 p.m.) before he fled by elevator (<a href=\"https://www.hk01.com/%E7%AA%81%E7%99%BC/60299887/%E5%AE%8F%E7%A6%8F%E8%8B%91%E5%A4%A7%E7%81%AB-9%E5%88%86%E9%90%98%E7%85%99%E6%94%BB%E5%AE%8F%E6%98%8C%E9%96%A3%E8%B5%B0%E5%BB%8A-%E4%BD%8F%E6%88%B6%E6%90%AD%F0%A8%8B%A2%E9%80%83-%E7%8C%B6%E8%B1%AB3%E5%88%86%E9%90%98%E6%88%96%E7%84%A1%E5%91%BD\">HK01</a>).</li>\n<li><strong>Fire spread and access</strong>: Initial outbreak on lower exterior of Wang Cheong House; spread to Wang Tai, Wang Shing, Wang Yan; Wang Chi largely spared (Guardian/Reuters). Interior temps reported above 500C; falling scaffolding and debris hindered rescues (CNN/Reuters/AP).</li>\n<li><strong>Resident account</strong>: Survivor Yip Ka-kui described hearing bamboo poles “explode” and mesh igniting before foam-sealed windows trapped his wife Bai Shui Lin, who died after warning neighbors (<a href=\"https://www.cbsnews.com/news/hong-kong-apartment-fire-survivor-wife/\">CBS News</a>).</li>\n<li><strong>Testing/documentation gaps</strong>: Pulse HK reports “testing reports” posted at other sites by contractor Hong Yip were merely mainland factory certificates (e.g., Binzhou center) that can be printed freely; another cited “National Labor Protection QC Center (Beijing)” was confirmed “100% fake.” HK01 similarly found multiple estates (e.g., Cheung Sha Wan Yee Kak, Chai Wan Fung Wah) displaying Binzhou/Beijing certificates for Shandong Chenxu nets; the Beijing lab said any post-2019 report using “監督” was “100% fake,” and numbers with “發證質檢(網)” were bogus (<a href=\"https://www.hk01.com/01%E5%81%B5%E6%9F%A5/60299456/%E5%AE%8F%E7%A6%8F%E8%8B%91%E5%A4%A7%E7%81%AB01%E8%BF%BD%E8%B9%A4-%E5%85%A9%E5%B1%8B%E8%8B%91%E7%94%A8%E5%B1%B1%E6%9D%B1%E6%A3%9A%E7%B6%B2-%E4%BA%AC%E6%AA%A2%E6%B8%AC%E4%B8%AD%E5%BF%83-%E5%A0%B1%E5%91%8A%E7%99%BE%E5%88%86%E7%99%BE%E5%81%87\">HK01</a>). Whistleblower 潘焯鴻 (Jason Poon) stresses only HOKLAS/CNAS lab sampling after delivery counts; industry veteran says temporary materials like scaffold nets rely on self-checks by the site’s Authorized Person, creating loopholes unless consultants enforce sampling and verify suppliers/labs (<a href=\"https://pulsehknews.com/20251203faketestreport/\">Pulse HK</a>).</li>\n<li><strong>External expert assessment</strong>: Grenfell Tower inquiry expert José Luis Torero (UCL) says Wang Fuk Court and Grenfell shared vertical spread driven by combustible exterior materials and smoke overrunning corridors/stairs; bamboo/netting may have aided but likely not the main driver versus foam/polystyrene cladding and channel-flow between closely spaced towers. He frames the disaster as a systemic competency failure across contractors, engineers, management, and regulators, calling for a Grenfell-level technical inquiry into materials, spacing assumptions, compartmentation, and smoke-path failure (<a href=\"https://hk.finance.yahoo.com/news/%E8%8B%B1%E7%81%AB%E7%81%BD%E8%AA%BF%E6%9F%A5%E5%B0%88%E5%AE%B6-%E5%88%B6%E5%BA%A6%E5%A4%B1%E6%95%88%E7%8C%9B%E6%96%BC%E7%81%AB-2017%E5%80%AB%E6%95%A6%E4%BD%8F%E5%AE%85%E5%A4%A7%E5%BB%88%E7%87%92%E9%80%9A%E9%A0%82-%E8%88%87%E5%AE%8F%E7%A6%8F%E8%8B%91%E7%9B%B8%E4%BC%BC-184700834.html\">Yahoo/信報</a>).</li>\n<li><strong>Policy and regulatory actions</strong>: Mainland authorities ordered a nationwide inspection of high-rises—especially under renovation with bamboo/wood scaffolding and non-flame-retardant nets—while Hong Kong said 7 of 20 netting samples failed and signaled a gradual shift toward metal scaffolding without blaming bamboo alone (<a href=\"https://www.wsj.com/world/china/hong-kongs-response-to-deadly-fire-is-squeezed-by-chinas-firm-hand-ea01b5a2\">WSJ</a>).</li>\n<li><strong>Market-wide testing (Dec 2025)</strong>: Castco Testing Centre (佳力高試驗中心), a HOKLAS-accredited government-designated lab, received over 100 inquiries after the Wang Fuk Court fire and tested ~20 scaffolding net samples from contractors and netting companies this month; ~80% failed fire-retardancy standards. One sample burned for over 40 seconds—10 times the 4-second average limit required under standards. Lab video shows fire spreading upward with burning debris falling, net almost entirely ablaze, and debris continuing to burn after the test ended. Senior manager Chan Man-kwong (陳文光): \"If it burns that long, it absolutely has no flame retardancy.\" Construction union leader Chau Si-kit (周思傑) notes the industry historically treated scaffolding as temporary equipment and undervalued fire safety for major repairs (<a href=\"https://news.now.com/home/local/player?newsId=630888\">Now News</a>).</li>\n<li><strong>New regulatory measures (Dec 2025)</strong>: Authorities introduced strengthened controls: contractors must provide flame-retardancy performance certificates for scaffolding nets; incoming materials must be sampled and tested after arrival in Hong Kong; designated-lab test reports must carry digital signatures for authentication; testing turnaround is ~3 working days (<a href=\"https://news.now.com/home/local/player?newsId=630888\">Now News</a>).</li>\n<li><strong>Oversight fallout</strong>: Officials suspended 28 other renovation projects run by the same contractor while citing cost-cutting mesh swaps after a typhoon; analysts warn the safety gaps and bid-rigging risks extend across Hong Kong’s high-rise stock (<a href=\"https://apnews.com/article/hong-wang-china-dissent-fire-construction-ff953aec2bc0201b0e3255805a241fc1\">AP</a>).</li>\n<li><strong>Scene documentation</strong>: On Nov 30 the Disaster Victim Identification Unit entered the towers to map interiors and recover remains; widely shared photos show flats reduced to ash with exposed rebar, blackened walls, and charred fixtures, highlighting the scale of destruction across seven of eight blocks (<a href=\"https://www.thestandard.com.hk/hong-kong-news/article/318169/\">The Standard</a>).</li>\n</ul>\n<p><img src=\"/assets/burnt_house_hkpf.jpg\" alt=\"Burned interior at Wang Fuk Court showing collapsed plaster, ash-covered floors, and charred fixtures — DVIU survey photo.\"></p>\n<h2 id=\"insurance-and-liability\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#insurance-and-liability\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Insurance and Liability</h2>\n<ul>\n<li>Taiping Hong Kong (insurer for Wang Fuk Court renovation and estate policies) paid a first batch of nine home-insurance claims totaling HK$5.372m on Dec 1; the estate’s property insurance carries a reported HK$20b sum insured with third-party liability cover up to HK$200m per incident, backed by reinsurance partners including Qianhai Re, China Re P&#x26;C, and Taiping Re (<a href=\"https://finance.sina.com.cn/roll/2025-12-02/doc-infzmppc0220721.shtml\">Sina</a>).</li>\n<li>Coverage in place includes construction all-risk, employees’ compensation, owners’ corporation third-party liability, property all-risk/public liability, and some household/helper policies; industry estimates expect payouts to approach policy limits, with reinsurers sharing the exposure (Sina).</li>\n</ul>\n<h2 id=\"tender-irregularities-and-oversight-gaps\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#tender-irregularities-and-oversight-gaps\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Tender Irregularities and Oversight Gaps</h2>\n<ul>\n<li><strong>Industry-wide bid-rigging scope</strong>: Since 2023, Competition Commission and ICAC crackdowns dismantled at least 4 bid-rigging syndicates involved in 70+ renovation projects worth HK$2.3 billion. In September 2025—less than three months before the fire—the Competition Commission raided 9 contractors in connection with alleged bid-rigging involving 25 projects worth HK$600 million, describing two syndicates as \"sizable\" with \"cohesive organizational structures\" that had been \"operating for some time\" (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n<li><strong>2015 first conviction</strong>: Hong Kong's first bid-rigging conviction saw a middleman sentenced to 35 months for conspiracy to offer bribes totaling ~HK$45 million. Judge Josiah Lam warned that lack of competition and oversight allowed contractors to \"further lower the quality of a project\" and \"maximize exorbitant profits\" (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n<li>Mandatory Building Inspection Scheme (MBIS): The Wang Fuk Court renovation was commissioned under the 2012 MBIS; after the 2023 tender the price jumped from an estimated HK$140m to HK$330m (RFI).</li>\n<li>Budget escalation: SCMP reports internal documents showing Wang Fuk Court’s budget rising from HK$152m (Sep 2023 analysis) to HK$336m after adopting the most expensive option, including full mosaic removal/repaving and added drainage/fire upgrades; experts call the renovation sector “rotten” with bid-rigging/collusion and urge an overhaul (<a href=\"https://www.scmp.com/news/hong-kong/society/article/3334964/whole-market-rotten-hong-kong-fire-exposes-greedy-building-renovation-business\">SCMP</a>).</li>\n<li>Alleged bid-rigging and interference: Residents reported suspected triad-linked individuals blocking dissenting owners from meetings; a new owners’ corporation replaced the old one in Sep 2024 after the contract was already signed (RFI).</li>\n<li>Academic/press analysis of collusion: Points Media cites a 2022 paper (Leung Tsang Tsui, Singapore Economic Review) using the now-closed FactWire database to show the Mandatory Building Inspection Scheme cut owners’ bargaining power, raising renovation bids ~40% and fostering collusion; Prestige Construction &#x26; Engineering Ltd. (宏業建築工程有限公司; aka Hong Yip Construction Engineering) was among the most active firms (104 bids, with unusually high/low rankings). Article notes pro-Beijing Ta Kung Pao removed a piece calling Prestige a “常勝將軍,” and quotes anonymous consultants alleging “招標妥” advisors take kickbacks, eroding oversight (<a href=\"https://points-media.com/%e9%a6%99%e6%b8%af/%e9%a6%99%e6%b8%af-%e4%b8%96%e7%b4%80%e5%a4%a7%e7%81%ab-%e5%ad%b8%e8%80%85-%e5%bc%b7%e5%88%b6%e9%a9%97%e6%a8%93-%e5%88%b6%e5%ba%a6-%e5%9c%8d%e6%a8%99-%e8%ad%b0%e5%83%b9-%e5%ae%8f%e6%a5%ad/\">Points Media</a>).</li>\n<li>Property management role: Bloomberg reports ISS A/S shares fell up to 11% on Dec 2 after SCMP noted its unit EastPoint Properties acted as Wang Fuk Court property manager. ISS says it only handled administrative tendering for the Incorporated Owners via an e-tender platform, made no recommendations, and welcomes the judge-led independent committee (<a href=\"https://www.bloomberg.com/news/articles/2025-12-02/iss-shares-plunge-after-hong-kong-launches-apartment-fire-probe\">Bloomberg</a>).</li>\n<li>URA scoring controversy: HKEJ says contractor Prestige Construction &#x26; Engineering Ltd. (宏業建築工程有限公司; aka Hong Yip Construction Engineering) received a 100/100 “project management” rating under the Urban Renewal Authority’s Building Rehab Company Registration Scheme. URA admits the display could mislead the public into thinking it is an overall contractor grade rather than a system-integrity check; the scheme also did not require declarations of site-safety convictions. URA plans to revise the audit scope/methods/display and to review its “招標妥” tender-support service to ensure consultant technical scoring is based on verifiable data and to reduce corruption/bid-rigging risks (<a href=\"https://www.hkej.com/instantnews/article?id=4264192\">HKEJ</a>).</li>\n<li>ICAC complaints and scope concerns: Residents told i-Cable they tipped ICAC before the contract was signed but were asked for evidence and saw no probe until after the fire; a July 2024 owners’ briefing featured a lawyer warning owners they would bear legal liability if a leadership change voided the contract, discouraging a halt. The contractor reportedly runs repairs at 11 estates; other estates paused work and removed scaffold netting after the blaze while consultants demanded proof of flame-retardant materials and stricter site no-smoking enforcement (<a href=\"https://www.i-cable.com/%E6%96%B0%E8%81%9E%E8%B3%87%E8%A8%8A/415811/%E4%B8%80%E7%B7%9A%E6%90%9C%E6%9F%A5-%E5%AE%8F%E7%A6%8F%E8%8B%91%E5%A4%A7%E7%81%AB%E8%83%8C%E5%BE%8C-%E4%B8%89%E7%96%91%E9%BB%9E%E6%83%B9%E9%97%9C%E6%B3%A8-%E5%B1%85%E6%B0%91\">i-Cable</a>).</li>\n<li>Complaints ignored: During works, residents complained to multiple departments about flammable mesh and foam sealing windows but “got nowhere”; disqualified pro-democracy district councillors who tried to assist were expelled for lacking official status (RFI).</li>\n<li>Historical context: FactWire's 2017 database (3,000 bids across 220 estates) highlighted systemic bid-rigging patterns in building maintenance—low consultant fees, market concentration, irregular pricing—mirroring current suspicions <a href=\"https://www.dotdotnews.com/a/202512/01/AP692d69ede4b0c32d4f618e05.html\">FactWire</a>.</li>\n<li>Prior enforcement: In April and August 2024, ICAC and the Competition Commission conducted two joint operations against syndicates suspected of graft and bid-rigging, arresting 25 people (<a href=\"https://hongkongfp.com/2026/01/02/anti-graft-agency-arrests-21-over-housing-estate-renovation-projects-in-kwun-tong/\">HKFP</a>).</li>\n<li><strong>Parallel cases post-fire</strong>:\n<ul>\n<li><strong>Sui Wo Court</strong> (near Wang Fuk Court): Residents gathered every weekend since early 2025 to voice concerns about a HK$371 million maintenance project that was supposed to wrap up in December but has not been completed; one resident reported receiving an anonymous thank-you card for allowing someone to vote on her behalf when she had voted in person. Homeowners committee chairwoman Pauline Leung Po-ling denied wrongdoing; ICAC said no case to answer (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n<li><strong>Fairview Park</strong> (Yuen Long): Homeowners campaigned against a HK$500 million plan to replace underground water pipes. In September 2025 the property management company refused to provide a detailed budget breakdown, tender evaluation criteria, or contractor identity before contract signing; after the Wang Fuk Court fire the company agreed to residents' demands and halted the project. At least 30 residents marched to ICAC to demand an investigation (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n</ul>\n</li>\n<li>Post-fire Kwun Tong sweep (Jan 2, 2026): ICAC arrested 21 people (15 men, 6 women, aged 30–81) over renovation bid-rigging at two Kwun Tong estates, neutralizing a \"building maintenance corruption syndicate controlled by individuals with triad background.\" Targets included intermediaries, engineering consultants, and owners' incorporation members; one HK$33m contract allegedly secured via bribes. The operation underscores systemic bid-rigging concerns amplified by the Wang Fuk Court fire (<a href=\"https://hongkongfp.com/2026/01/02/anti-graft-agency-arrests-21-over-housing-estate-renovation-projects-in-kwun-tong/\">HKFP</a>).</li>\n<li>Anti-bid-rigging push (2016): Former ICAC investigator and Democratic Party lawmaker Lam Cheuk-ting, long active on bid-rigging cases, stood with the Anti-Bid-Rigging Alliance to warn government amendment proposals lacked deterrence and called for stronger criminal sanctions; they cited a decade of systemic tender corruption and publicized a hotline (<a href=\"https://www.hk01.com/article/21100?utm_source=01articlecopy&#x26;utm_medium=referral\">HK01</a>). <img src=\"/assets/gettyimages-1096254312-1024x1024.jpg\" alt=\"Lam Cheuk-ting (center right) speaking at an Anti-Bid-Rigging Alliance presser, 2016. Credit: David Wong/South China Morning Post via Getty Images.\"></li>\n<li>Demands for action: Whistleblower 潘焯鴻 (Jason Poon) posted on Nov 26 urging immediate net inspections at other estates (e.g., Sui Wo, On Kay), evacuation/rehousing of ~3,000 households, criminal probes into fake netting documents, accountability for regulators, an Independent Commission of Inquiry, and travel bans/detentions for key IO members/contractors to prevent evidence flight (<a href=\"https://www.facebook.com/JasonPoonHongKong/posts/%E6%9D%8E%E5%AE%B6%E8%B6%85%E6%94%BF%E5%BA%9C%E5%B7%A5%E4%BD%9C%E6%B8%85%E5%96%AE-1-%E5%AE%8F%E7%A6%8F%E8%8B%91%E7%81%AB%E7%81%BD%E5%B7%B2%E7%B6%93%E7%84%A1%E5%8A%9B%E6%8C%BD%E6%87%89%E5%8B%95%E5%93%A1%E6%9B%B4%E5%A4%9A%E8%B3%87%E6%BA%90%E9%98%BB%E6%AD%A2%E7%AC%AC%E4%BA%8C%E5%80%8B%E5%AE%8F%E7%A6%8F%E8%8B%91%E7%81%BD%E9%9B%A3%E7%99%BC%E7%94%9F%E7%A9%97%E7%A6%BE%E8%8B%91%E5%AE%89%E5%9F%BA%E8%8B%91%E7%AD%89%E7%AD%89%E7%AB%8B%E5%8D%B3%E6%AA%A2%E6%9F%A5%E6%A3%9A%E7%B6%B22-%E5%B0%873000%E6%88%B6%E8%BF%9110000%E5%90%8D%E5%8D%B3%E6%99%82%E6%B5%81%E9%9B%A2%E5%A4%B1%E6%89%80%E7%9A%84%E5%B1%85%E6%B0%91%E5%AE%89/1375966570836591/\">Facebook</a>).</li>\n</ul>\n<h2 id=\"arrests-and-probes\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#arrests-and-probes\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Arrests and Probes</h2>\n<ul>\n<li><strong>ICAC strategy</strong>: ICAC told Bloomberg it is pursuing a \"three-pronged strategy of law enforcement, systemic prevention and community education\" to combat corruption in building maintenance and renovation (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n<li><strong>Safety certificate forgery</strong>: Police launched 8 investigations into alleged forgery of safety certificates required to certify scaffolding netting was flame-retardant; lime-green netting swiftly removed from 200+ buildings undergoing major maintenance on government orders (<a href=\"https://www.bloomberg.com/news/features/2025-12-30/hong-kong-fire-reveals-corruption-in-city-s-renovation-industry\">Bloomberg</a>).</li>\n<li>Manslaughter: 16 arrested on gross negligence related to renovation works; early arrests included contractor directors/consultant; later arrests expanded to scaffolding subcontractors and intermediary (<a href=\"https://hongkongfp.com/2026/01/02/anti-graft-agency-arrests-21-over-housing-estate-renovation-projects-in-kwun-tong/\">HKFP</a>).</li>\n<li>ICAC: Probe arrested 8 linked to renovation project (directors, project managers, subcontractors, intermediary); total 12 arrests reported including consultants, contractors, scaffolding heads (news.gov.hk). On Dec 17, ICAC arrested current OC chairperson Tsui Mun-kam (徐滿柑) and former chairperson Tang Kwok-kuen (鄧國權), who served five consecutive terms (2012–Sep 2024) and signed the HK$330m repair contract (<a href=\"https://hk.on.cc/hk/bkn/cnt/news/20251217/bkn-20251217175140460-1217_00822_001.html\">on.cc</a>).</li>\n<li>Fire-services contractor fraud (Dec 3): Police arrested six men (aged 44–55) from the fire-services contractor for alleged fraud, accusing them of falsely telling FSD they would not disable alarms during works while submitting notices citing only hydrant/hose reel shutdowns; all bailed to report in Jan 2026 (<a href=\"https://global.hk01.com/%E7%AA%81%E5%8F%91/60300231/%E5%AE%8F%E7%A6%8F%E8%8B%91%E5%A4%A7%E7%81%AB%E7%81%BE-%E8%AD%A6%E6%8B%98%E6%B6%88%E9%98%B2%E8%A3%85%E7%BD%AE%E6%89%BF%E5%8A%9E%E5%95%866%E4%BA%BA-%E6%B6%89%E8%AE%B9%E7%A7%B0%E5%B7%A5%E7%A8%8B%E6%97%B6%E4%B8%8D%E5%85%B3%E8%AD%A6%E9%92%9F\">HK01</a>).</li>\n<li>Materials: Police and officials allege flammable mesh/foam used; some netting initially certified compliant; ongoing verification of actual materials used on-site.</li>\n<li>Non-statutory review: Chief Executive John Lee announced a judge-led committee (non-statutory), pledging administrative directives for evidence access; statutory Independent Commission of Inquiry was rejected despite civic calls (RFI). On Dec 12 he said the panel, chaired by Electoral Affairs Commission head Judge David Lok, will report within nine months and examine systemic construction risks, conflicts of interest, collusion, and bid-rigging (Reuters).</li>\n<li><strong>First public meeting (Feb 5, 2026)</strong>: The independent committee held its first public meeting at City Gallery in Central. Senior Counsel Victor Dawes, the committee's leading counsel, said it had received evidence from authorities including \"key information and clues\" and already has a good understanding of the fire's cause and systemic issues. Residents can apply to give evidence by Feb 12; approved applicants must file submissions by Feb 23. Next hearing scheduled for Mar 19 when evidence examination begins. Judge Lok noted the committee could recommend conversion to a statutory Commission of Inquiry if powers prove insufficient, but said this would take \"years\" versus the expedited nine-month timeline. Attendees included lawyers for the committee, government, URA, and ISS Eastpoint Properties Ltd.; representatives of the Competition Commission, ICAC, and DOJ; and counsel for Wong Hap-yin, a director of Will Power Architects Company Limited (the consultancy overseeing repair works)—the only arrested person to attend. Residents called for accountability, with one surnamed Chan saying: \"I hope the investigation will clearly determine the insufficiencies of each government department so that we won't ever see this happen again\" (<a href=\"https://hongkongfp.com/2026/02/05/residents-of-fire-hit-estate-urge-accountability-compensation-as-review-committee-holds-first-public-meeting/\">HKFP</a>).</li>\n<li>Contractor fallout: Hung Ngai Architects Ltd. (宏毅建築師) — consultant on Wang Fuk Court and other estates — reportedly announced an immediate suspension/termination of all business after ICAC arrests; owners’ groups at Aberdeen Centre Phase 1 and On Kay Court voted to end their Hung Ngai contracts (on.cc).</li>\n<li>Parallel estate alarm: At Ngon Kei Court (Ngon Kei Yuen) on Dec 1, contractor Wai Lei Construction flame-tested scaffold-net samples from multiple floors; some ignited instantly. Consultant Hung Ngai (same as Wang Fuk Court) attributed it to glue drips, but residents called for replacing the consultant despite HK$150m repair costs; management blocked additional media sampling and called police (<a href=\"https://www.hkej.com/instantnews/current/article/4260928/%E5%AE%89%E5%9F%BA%E8%8B%91%E5%A4%A7%E7%B6%AD%E4%BF%AE+%E6%89%BF%E5%BB%BA%E5%95%86%E9%BB%9E%E7%87%83%E6%A3%9A%E7%B6%B2%E9%83%A8%E5%88%86%E6%9C%AA%E8%83%BD%E9%80%9A%E9%81%8E%E6%B8%AC%E8%A9%A6\">HKEJ</a>).</li>\n</ul>\n<h2 id=\"open-questions\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#open-questions\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Open Questions</h2>\n<ul>\n<li>Certification vs. installed materials: extent of material swapping; chain of custody for mesh/foam procurement.</li>\n<li>Alarm status pre-fire: whether systems were intentionally disabled during works and by whom.</li>\n<li>Regulatory oversight: adequacy of 16 prior inspections and enforcement actions before November 2025.</li>\n</ul>\n<h2 id=\"official-statements-and-gaps\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#official-statements-and-gaps\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Official Statements and Gaps</h2>\n<ul>\n<li>John Lee (Dec 2 presser) acknowledged systemic deficiencies, promised reforms and accountability, and said fires occur globally; condemned “hostile” acts exploiting the tragedy. Deferred on scaffold sampling accuracy while citing ongoing Buildings Department checks (<a href=\"https://www.inmediahk.net/node/%E6%94%BF%E7%B6%93/%E3%80%90%E5%AE%8F%E7%A6%8F%E8%8B%91%E4%BA%94%E7%B4%9A%E7%81%AB%E3%80%91%E8%A2%AB%E5%95%8F%E7%82%BA%E4%BD%95%E5%80%BC%E5%BE%97%E7%95%99%E4%BB%BB-%E6%9D%8E%E5%AE%B6%E8%B6%85%E7%A8%B1%E7%84%A1%E4%BA%BA%E9%A1%98%E8%A6%8B%E5%A4%A7%E7%81%AB-%E9%9C%80%E6%94%B9%E9%9D%A9%E7%B4%AF%E7%A9%8D%E5%95%8F%E9%A1%8C\">InMediaHK</a>).</li>\n<li>Eight reform questions (John Lee): construction safety requirements/maintenance; conflicts of interest and collusion across project stages; completeness of safety standards and testing; roles and accountability of regulators (government and professionals); risks of corruption/bid-rigging and tender violations; fire-system supervision and responsibility; attribution of liability for the blaze; adequacy of current penalties (RFI).</li>\n<li>Bamboo scapegoating dispute: Mourning visitors and experts argued bamboo scaffolding was not the spread driver; on-site placards read “要检讨嘅唔系竹棚 而系个制度” (“The problem to review isn’t bamboo, it’s the system”). Development Bureau later said its metal-scaffold roadmap was misread as blaming bamboo; PolyU’s Xinyan Huang apologized for Channel 4 remarks and said bamboo’s role needs systematic study (RFI/PolyU).</li>\n<li>Cultural heritage defense (Dec 5): Artnet reports artists, architects, and cultural historians circulated “Leave the bamboo alone” posts to defend bamboo as an intangible craft after early media blame and citywide scaffold-mesh removals; the piece notes 21 arrests on suspicion of manslaughter (media tallies vary) (<a href=\"https://news.artnet.com/art-world/hong-kong-fire-bamboo-culture-2723917\">Artnet</a>).</li>\n<li>Bamboo vs. mesh: Residents’ experiments circulated online showing bamboo charring while scaffold nets burned to ash; ABC noted bamboo frames survived while nets were destroyed, reinforcing suspicions that non-compliant mesh fueled rapid spread (<a href=\"https://www.abc.net.au/news/2025-12-02/tai-po-fire-hong-kong-mainland-grief-red-lines/106087732\">ABC</a>).</li>\n</ul>\n<h2 id=\"prior-warnings\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#prior-warnings\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Prior Warnings</h2>\n<ul>\n<li>Jason Poon (Pan Zhuohong) flagged non-compliant netting via videos/emails on 2024-05-17; warning video circulated (Facebook).</li>\n<li>Resident complaints in Sep 2024 to the Labor Department about flammable netting and foam boards; department initially said netting not regulated, later cited contractor certificates after 16 inspections and issued notices/prosecutions (NYT).</li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/notes/9e5b0uhf2vl7gk4rj1tzp3x\">🔥 Hong Kong Fire 2025</a></li>\n<li><a href=\"/notes/y0btw9fndm8l2h5q7se3kxr\">People</a></li>\n<li><a href=\"/notes/wm9v6z1k5rx4nqlu8g03b2t\">Timeline</a></li>\n</ul>","noteIndex":{"id":"pfy4h1nwep9age7eg0u8xe1","title":"SHKO(Save Hong Kong Online)","desc":"","updated":1754149906369,"created":1648525691085,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"1167e18cbbf8cd03a6aaaa0085a8945f","links":[{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"sites.rfa_cantonese","alias":"RFA Cantonese","position":{"start":{"line":7,"column":125,"offset":807},"end":{"line":7,"column":162,"offset":844},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sites.rfa_cantonese"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"Hong Kong Fire 2025","alias":"hong-kong-fire-2025","position":{"start":{"line":11,"column":30,"offset":1119},"end":{"line":11,"column":73,"offset":1162},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"Hong Kong Fire 2025"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"⚖️ Jimmy Lai case","alias":"jimmy-lai","position":{"start":{"line":11,"column":256,"offset":1345},"end":{"line":11,"column":287,"offset":1376},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"⚖️ Jimmy Lai case"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"sites","alias":"websites or online causes","position":{"start":{"line":20,"column":34,"offset":1890},"end":{"line":20,"column":71,"offset":1927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sites"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"howto","alias":"contribute","position":{"start":{"line":20,"column":201,"offset":2057},"end":{"line":20,"column":223,"offset":2079},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"howto"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"sponsorship","alias":"sponsor","position":{"start":{"line":20,"column":246,"offset":2102},"end":{"line":20,"column":271,"offset":2127},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sponsorship"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"sites.appledaily","alias":"sites.appledaily","position":{"start":{"line":23,"column":3,"offset":2178},"end":{"line":23,"column":23,"offset":2198},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sites.appledaily"}},{"type":"wiki","from":{"fname":"root","id":"pfy4h1nwep9age7eg0u8xe1","vaultName":"vault"},"value":"sites.inmediahk","alias":"sites.inmediahk","position":{"start":{"line":24,"column":3,"offset":2213},"end":{"line":24,"column":22,"offset":2232},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"sites.inmediahk"}}],"anchors":{"goals":{"type":"header","text":"Goals","value":"goals","line":19,"column":0,"depth":2},"quick-facts":{"type":"header","text":"Quick Facts","value":"quick-facts","line":24,"column":0,"depth":2}},"children":["fzfda8r3h330gsr6wg5db9w","dr6y9n9s72kljfnr7bpwvqj","9e5b0uhf2vl7gk4rj1tzp3x","iu6nr9qel896bjhbckfl05d","jl8k2mxp4vy7nrt1qw5b3ez","vzihkvznemcaaef2br0s1co","wx39zljncctue32jn06u29u","brr1zrug1jl02gi80d1dv8c"],"parent":null,"data":{},"body":"\n[![Great Extinction](/assets/extinctions.jpeg)](/notes/wx39zljncctue32jn06u29u/) \n> (_Courtesy: [Hong Kong Freepress](https://hongkongfp.com/2021/11/28/explainer-over-50-groups-gone-in-11-months-how-hong-kongs-pro-democracy-forces-crumbled/), 2021_) \n\nSHKO (Save Hong Kong Online) is a community-driven project dedicated to preserving the rapidly disappearing websites and online resources of Hong Kong’s civil society and independent media since 2019. In response to the sweeping shutdowns caused by political changes in Hong Kong, we aim to safeguard digital heritage before it vanishes. This project is anonymous, open source, and supported by a global network of contributors.\n\nWhile most sites in our archive were forced offline due to Hong Kong’s political deterioration, it’s important to note that [[RFA Cantonese|sites.rfa_cantonese]] is the only site here closed not because of Hong Kong’s situation, but due to internal political decisions in the United States.\n\nExplore our full list of preserved sites and archives on the [Collections page](/notes/wx39zljncctue32jn06u29u/).\n\nRecent work: documenting the [[hong-kong-fire-2025|Hong Kong Fire 2025]] tragedy at Wang Fuk Court (168 dead, ongoing probes into flammable mesh/foam, bid-rigging, and a judge-led review), including activism, timeline, and investigation subpages; and the [[jimmy-lai|⚖️ Jimmy Lai case]] — Apple Daily founder sentenced to 20 years under the National Security Law (Feb 2026), with coverage of press freedom impact and international response.\n\n## Goals\n- To preserve as much information as possible before its disappearance during Hong Kong's great transition\n- To illustrate a viable method that everyone can use to help preserve online heritage with no pains\n- To demonstrate global collaborations to save local digital heritages with best practices\n\n## Quick Facts\n\nWe are working on over dozens of [[websites or online causes | sites]] in Hong Kong in the past two decades which has been forced to shutdown or at the brink of disappearing. We'd welcome anyone help [[contribute | howto]] to the content and/or [[sponsor | sponsorship]] our program to sustain it together. \n\nExamples:\n- [[sites.appledaily]] (Extincted)\n- [[sites.inmediahk]] (In Danger)\n\n\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"siteUrl":"https://savehkonline.org","enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"logoPath":"vault/assets/yellow_black_logo.png","enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Save Hong Kong Online","description":"Using community driven backup services to backup Hong Kong's extincting web heritages"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/China-Digital-Times-CDT/wepreserve"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enablePrettyLinks":true,"duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"enablePrettyRefs":true,"siteFaviconPath":"favicon.ico","siteIndex":"root","enableTaskNotes":true,"searchMode":"lookup"}}},"__N_SSG":true}